Scheduler/src/Documents/УчебныйДень/УчебныйДень.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчебныйДень</name>
  <registerRecords>AccumulationRegister.ПрошедшиеЗанятия</registerRecords>
  <registerRecords>InformationRegister.ДомашниеЗадания</registerRecords>
  <registerRecords>InformationRegister.Оценки</registerRecords>
  <tabularSections>
    <name>Уроки</name>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.Предметы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДомашнееЗадание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийУчителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Scheduler/src/InformationRegisters/Оценки/Оценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Оценки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Предметы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерУрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Scheduler/src/AccumulationRegisters/ПрошедшиеЗанятия/ПрошедшиеЗанятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрошедшиеЗанятия</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоУроков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Предметы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Scheduler/src/InformationRegisters/ДомашниеЗадания/ДомашниеЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДомашниеЗадания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДомашнееЗадание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Предметы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Scheduler/src/Documents/УчебныйДень/ObjectModule.bsl
#Если Сервер Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Номер = ОбщегоНазначенияСервер.ПолучитьНомер(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Оценки.Записывать = Истина;
	Движения.ПрошедшиеЗанятия.Записывать = Истина;
	Для Каждого ТекСтрокаУроки Из Уроки Цикл
		
		// Регистр Оценки
		Если ЗначениеЗаполнено(ТекСтрокаУроки.Оценка) Тогда
			Движение = Движения.Оценки.Добавить();
			Движение.Период = Дата;
			Движение.Предмет = ТекСтрокаУроки.Предмет;
			Движение.НомерУрока = ТекСтрокаУроки.НомерСтроки;
			Движение.Оценка = ТекСтрокаУроки.Оценка;
			
		КонецЕсли;
		
		// Регистр ПрошедшиеЗанятия
		Движение = Движения.ПрошедшиеЗанятия.Добавить();
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаУроки.Предмет;
		Движение.КоличествоУроков = 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Регистр ДомашниеЗадания.
	НаборЗаписей = РегистрыСведений.ДомашниеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого СтрокаТабличнойЧасти Из Уроки Цикл
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДомашнееЗадание) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();	
			НоваяЗапись.Период          = НачалоДня(Дата);
			НоваяЗапись.Предмет         = СтрокаТабличнойЧасти.Предмет;
			НоваяЗапись.ДомашнееЗадание = СтрокаТабличнойЧасти.ДомашнееЗадание;
			НоваяЗапись.Выполнено       = СтрокаТабличнойЧасти.Выполнено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

#КонецЕсли
